## Modules

In [ ]:
#Ex:1

import math

In [ ]:
x = 16
math.sqrt(x)

In [ ]:
math.pow(2,5)

In [ ]:
dir(math)

In [ ]:
#Ex:2

import calendar

In [ ]:
cal = calendar.month(2022,11)

In [ ]:
print(cal)

In [ ]:
calendar.isleap(2020)

In [ ]:
calendar.isleap(2022)

In [ ]:
dir(calendar)

In [ ]:
#Ex.3
import datetime

In [ ]:
x = datetime.datetime.now()
print(x)

In [ ]:
y=datetime.date.today()
print(y)

In [ ]:
dir(datetime)

In [ ]:
a=datetime.date(1985,7,30)
print(a)

In [ ]:
a.year

In [ ]:
a.month

In [ ]:
a.day

In [ ]:
x_date=datetime.date(2020,7,30)

In [ ]:
x_time=datetime.time(20,25,0)

In [ ]:
x_datetime=datetime.datetime(2021,1,20,20,25,0,0)

In [ ]:
print(x_date)

In [ ]:
print(x_time)

In [ ]:
print(x_datetime)

## Dataframe

In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [ ]:
import webbrowser

In [ ]:
website = 'https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html'

In [ ]:
webbrowser.open(website)

In [ ]:
df= pd.read_clipboard()

In [ ]:
df

## Creating dataframes using numpy and dictionaries

In [ ]:
x=np.array([[1,2,3],[4,5,6]])
x

In [ ]:
dict1=DataFrame({'col1':[1,2,3],"col2":['a','b','c']})
dict1

In [ ]:
## Read a csv file
df1 = pd.read_csv('Universities.csv')

In [ ]:
df1

In [ ]:
type(df1)

In [ ]:
df1.columns

In [ ]:
df1.SAT

In [ ]:
df1['SAT']

In [ ]:
df1[['SAT']]

In [ ]:
df1[['SAT','Accept']]

In [ ]:
df1.head()

In [ ]:
df1.head(10)

In [ ]:
df1.tail()

In [ ]:
df1.tail(10)

In [ ]:
df1.head()

In [ ]:
df1.iloc[2]

In [ ]:
df1.iloc[3:5]

In [ ]:
df2 = pd.read_csv('Universities.csv',index_col = 'Univ')
df2

In [ ]:
df2.loc['Yale']

In [ ]:
df2.iloc[2]

In [ ]:
df2.loc[['UVA','Yale']]

In [ ]:
df2.loc['UVA':'Yale']

In [ ]:
df2.shape

In [ ]:
x= df2.drop('Yale')
x

In [ ]:
x.shape

In [ ]:
y = df2.drop('Top10',axis=1)
y

In [ ]:
y.shape

In [ ]:
df2.describe()

## Handling with null values

In [3]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [4]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [5]:
new_frame= dframe.dropna() # Drop the rows having na 
new_frame

     0    1    2
0  1.0  2.0  3.0

In [6]:
new_frame=dframe.dropna(how='all')  # Drop the rows having na's in all the columnns
new_frame

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [7]:
new_frame=dframe.dropna(axis = 1)  # Drop the Columns having na's in all the columns
new_frame

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [8]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [9]:
dframe.dropna(thresh = 2) # Drop the rows not having  atleast 2 values

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [10]:
dframe.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  0.0  9.0
3  0.0  0.0  0.0